import { Link } from "react-router-dom";
import Logo from "../assets/stk-logo.png";
import Main from "../assets/stk-main.png";

const MainPage = () => {
  return (
    <>
      <div className="header">
        <div className="wrapper">
          <div className="header-wrapper">
            <div className="header-logo">
              <img width="40" height="40" src={Logo} alt="logo" />
              Stake<span className="purple">out</span>
            </div>
            <nav className="nav">
              <a href="#" className="nav-item">
                О проекте
              </a>
              <a href="#" className="nav-item">
                Цели
              </a>
              <a href="#" className="nav-item">
                Алгоритм
              </a>
              <a href="#" className="nav-item">
                Инвесторам
              </a>
              <a href="#" className="nav-item">
                Философия
              </a>
            </nav>
            <div className="header-links">
              <Link to="/regestration">
                <li className="header-item">Регистрация</li>
              </Link>
              <Link to="/login">
                <button className="header-btn">Войти</button>
              </Link>
            </div>
          </div>
        </div>
      </div>

      <div className="main">
        <div className="wrapper">
          {/* блок о доходах */}
          <div className="content">
            <div className="content-text">
              <div className="content-title">
                Получай <span className="purple">знания</span> и постоянный{" "}
                <span className="purple"> доход</span>
              </div>
              <div className="content-description">
                С помощью Stakeout вы не только будете получать пассивный доход,
                но и получите актуальные знания и навыки работы с blockchain
              </div>
              <button className="content-btn">Начните прямо сейчас</button>
            </div>
            <div className="content-image">
              <img src={Main} alt="main" />
            </div>
          </div>
          {/* блок с преимуществами  */}
          <div className="advantages">
            <div className="advantages-cart">
              <div className="advantages-circle">
                <svg
                  width="13"
                  height="24"
                  viewBox="0 0 13 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M6.69778 10.3813C3.92334 9.60598 3.03111 8.80438 3.03111 7.556C3.03111 6.12364 4.26556 5.12494 6.33111 5.12494C8.50667 5.12494 9.31334 6.24191 9.38667 7.88452H12.0878C12.0022 5.62429 10.7189 3.54803 8.16445 2.87785V0H4.49778V2.83843C2.12667 3.39034 0.22 5.04609 0.22 7.58228C0.22 10.6178 2.55445 12.129 5.96445 13.0095C9.02 13.7979 9.63112 14.9543 9.63112 16.1764C9.63112 17.0831 9.03223 18.5286 6.33111 18.5286C3.81334 18.5286 2.82334 17.3197 2.68889 15.769H0C0.146667 18.6469 2.15111 20.2632 4.49778 20.802V23.6536H8.16445V20.8283C10.5478 20.3421 12.4422 18.8571 12.4422 16.1633C12.4422 12.4313 9.47223 11.1566 6.69778 10.3813Z"
                    fill="white"
                  />
                </svg>
              </div>
              <div className="advantages-text">
                <h3>Зарабатывайте</h3>
                <p>благодаря знаниям</p>
              </div>
            </div>
            {/* 2 карточка */}
            <div className="advantages-cart">
              <div className="advantages-circle">
                <svg
                  width="18"
                  height="17"
                  viewBox="0 0 18 17"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M4.35095 8.366C3.35362 8.366 2.55429 8.10933 1.95295 7.596C1.35162 7.068 1.02162 6.364 0.962953 5.484C0.93362 5.044 0.918953 4.736 0.918953 4.56C0.918953 4.384 0.93362 4.00267 0.962953 3.416C1.00695 2.52133 1.32229 1.81 1.90895 1.282C2.49562 0.753999 3.30962 0.489999 4.35095 0.489999C5.37762 0.489999 6.18429 0.753999 6.77095 1.282C7.35762 1.81 7.67295 2.52133 7.71695 3.416C7.74629 4.00267 7.76095 4.384 7.76095 4.56C7.76095 4.736 7.74629 5.044 7.71695 5.484C7.65829 6.364 7.32829 7.068 6.72695 7.596C6.12562 8.10933 5.33362 8.366 4.35095 8.366ZM2.59095 16C2.44429 16 2.31962 15.9633 2.21695 15.89C2.12895 15.802 2.08495 15.692 2.08495 15.56C2.08495 15.472 2.11429 15.3913 2.17295 15.318L13.041 1.018C13.1583 0.871332 13.2683 0.768666 13.371 0.709999C13.4736 0.636666 13.6203 0.599999 13.811 0.599999H15.373C15.5196 0.599999 15.637 0.643999 15.725 0.732C15.8276 0.805333 15.879 0.908 15.879 1.04C15.879 1.128 15.8496 1.20867 15.791 1.282L4.92295 15.582C4.80562 15.7287 4.69562 15.8387 4.59295 15.912C4.49029 15.9707 4.34362 16 4.15295 16H2.59095ZM4.35095 6.452C4.96695 6.452 5.30429 6.09267 5.36295 5.374C5.39229 4.90467 5.40695 4.59667 5.40695 4.45C5.40695 4.25933 5.39229 3.95867 5.36295 3.548C5.34829 3.22533 5.25295 2.96133 5.07695 2.756C4.91562 2.55067 4.67362 2.448 4.35095 2.448C4.01362 2.448 3.76429 2.55067 3.60295 2.756C3.44162 2.96133 3.34629 3.22533 3.31695 3.548C3.30229 3.75333 3.29495 4.054 3.29495 4.45C3.29495 4.83133 3.30229 5.13933 3.31695 5.374C3.37562 6.09267 3.72029 6.452 4.35095 6.452ZM13.657 16.11C12.6596 16.11 11.8603 15.8533 11.259 15.34C10.6723 14.812 10.3423 14.1007 10.269 13.206C10.2543 12.9567 10.247 12.6193 10.247 12.194C10.247 11.754 10.2543 11.402 10.269 11.138C10.3276 10.2287 10.643 9.51 11.215 8.982C11.8016 8.454 12.6156 8.19 13.657 8.19C14.6983 8.19 15.505 8.454 16.077 8.982C16.6636 9.51 16.9863 10.2287 17.045 11.138C17.0743 11.7247 17.089 12.106 17.089 12.282C17.089 12.458 17.0743 12.766 17.045 13.206C16.9863 14.086 16.6563 14.79 16.055 15.318C15.4536 15.846 14.6543 16.11 13.657 16.11ZM13.657 14.174C13.9943 14.174 14.2436 14.0713 14.405 13.866C14.5663 13.646 14.6616 13.382 14.691 13.074C14.7203 12.634 14.735 12.326 14.735 12.15C14.735 11.9593 14.7203 11.6587 14.691 11.248C14.6616 10.94 14.5663 10.6833 14.405 10.478C14.2436 10.258 13.9943 10.148 13.657 10.148C13.3196 10.148 13.0703 10.258 12.909 10.478C12.7476 10.6833 12.6596 10.94 12.645 11.248C12.6303 11.4533 12.623 11.754 12.623 12.15C12.623 12.546 12.6303 12.854 12.645 13.074C12.6743 13.3967 12.7623 13.6607 12.909 13.866C13.0703 14.0713 13.3196 14.174 13.657 14.174Z"
                    fill="white"
                  />
                </svg>
              </div>
              <div className="advantages-text">
                <h3>До 4.5% в день</h3>
                <p>возможно и больше</p>
              </div>
            </div>
            {/* 3 карточка */}
            <div className="advantages-cart">
              <div className="advantages-circle">
                <svg
                  width="27"
                  height="24"
                  viewBox="0 0 27 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M24.4445 0H2.44445C1.08778 0 0 1.16953 0 2.62817V18.3972C0 19.8427 1.08778 21.0253 2.44445 21.0253H8.55556V23.6535H18.3334V21.0253H24.4445C25.7889 21.0253 26.8767 19.8427 26.8767 18.3972L26.8889 2.62817C26.8889 1.16953 25.7889 0 24.4445 0ZM24.4445 18.3972H2.44445V2.62817H24.4445V18.3972ZM18.3334 9.19859V11.8268H14.6667V15.769H12.2222V11.8268H8.55556V9.19859H12.2222V5.25633H14.6667V9.19859H18.3334Z"
                    fill="white"
                  />
                </svg>
              </div>
              <div className="advantages-text">
                <h3>Реклама</h3>
                <p>на нашей площадке</p>
              </div>
            </div>
          </div>

          {/* О ПРОЕКТЕ */}
          <div className="about">
            <h2 className="about-title">
              О <span className="purple">проекте</span>
            </h2>
            <div className="about-main">
              <div className="about-image">
                <div className="about-piramida1">21312312</div>
                <div className="about-piramida2"></div>
                <div className="about-piramida3"></div>
                <div className="about-piramida4"></div>
              </div>
              <div className="about-text">
                Ситуацию на рынке криптовалют можно охарактеризовать как
                усиленный интерес, переходящий в ажиотаж. В последнее время
                снято большое количество технических ограничений. Сейчас для
                работы на криптобиржах{" "}
                <span className="purple">достаточно иметь смартфон</span> с
                установленным специальным приложением. Но эксперты нашей команды
                отмечают тот факт, что многие не решаются сделать последний шаг,
                чтобы открыть для себя мир криптовалют и начать на нем
                зарабатывать. Возможно, кто-то попытался начать работать на
                криптобиржах, но в силу недостаточности актуальной информации не
                смог получить прибыль и прекратил. Это одна из причин, почему
                была разработана площадка{" "}
                <span className="purple">Stakeout</span>.
                <span className="purple">
                  {" "}
                  Мы стремимся к тому, чтобы мир криптовалют стал понятен для
                  каждого человека.
                </span>{" "}
                А ведь этот рынок настолько необычен и перспективен, что при
                наличии определенных знаний каждый может быстро заработать
                приличные деньги.
              </div>
            </div>
          </div>
        </div>
      </div>
    </>
  );
};
export default MainPage;
